# Part 2: Full Data Workflow A-Z

## Data Preparation and Feature Creation

### Arithmetic Operations

In [2]:
import pandas as pd
import numpy as np

In [3]:
titanic = pd.read_csv("titanic.csv")

In [ ]:
titanic.head()

In [ ]:
titanic.info()

In [ ]:
titanic.age.fillna(titanic.age.mean(), inplace = True)

In [ ]:
titanic.head(10)

#### Add/Sub/Mul/Div of Columns

In [ ]:
titanic.sibsp + titanic.parch

In [ ]:
titanic.sibsp.add(titanic.parch)

In [ ]:
titanic["no_relat"] = titanic.sibsp.add(titanic.parch)

In [ ]:
titanic.head()

In [ ]:
sales = pd.read_csv("sales.csv", index_col = 0)

In [ ]:
sales

In [ ]:
sales.Mon + sales.Thu

In [ ]:
sales.Mon.add(sales.Thu, fill_value=0)

In [ ]:
sales["perc_Bonus"] = [0.12, 0.15, 0.10, 0.20]

In [ ]:
sales

In [ ]:
sales.Thu * sales.perc_Bonus

In [ ]:
sales.Thu.mul(sales.perc_Bonus, fill_value=0)

In [ ]:
sales.iloc[:, :-1].sum(axis = 1).mul(sales.perc_Bonus)

In [ ]:
sales["Bonus"] = sales.iloc[:, :-1].sum(axis = 1).mul(sales.perc_Bonus)

In [ ]:
sales

#### Add/Sub/Mul/Div with Scaler Value

In [4]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [ ]:
1912 - titanic.age

In [ ]:
titanic["YoB"] = titanic.age.sub(1912).mul(-1)

In [ ]:
titanic.head()

In [ ]:
fx_rate = 1.1

In [ ]:
titanic["EUR_fare"] = titanic.fare.div(fx_rate)

In [ ]:
titanic.head()

In [ ]:
titanic.drop(columns = ["sibsp", "parch", "deck", "YoB", "EUR_fare"], inplace =True)

In [ ]:
titanic.head()

In [ ]:
sales

In [ ]:
fixed_costs = 5

In [ ]:
sales.iloc[:, :-2].sub(fixed_costs, fill_value = 0)

In [ ]:
perc_Bonus = 0.1

In [ ]:
sales.iloc[:, :-2].mul(perc_Bonus, fill_value = 0)

In [ ]:
sales.iloc[:,:-2]

In [ ]:
lot_size = 10
bonus_per_lot = 1.25

In [ ]:
sales.iloc[:, :-2].floordiv(lot_size, fill_value = 0).mul(bonus_per_lot).sum(axis = 1)

### Transformation / Mapping

In [5]:
summer = pd.read_csv("summer.csv")

In [6]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [15]:
sample = summer.sample(n = 7, random_state = 123).sort_values(by = "Year")

In [16]:
sample

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
4196,1924,Paris,Aquatics,Water polo,"AUSTIN, Arthur",USA,Men,Water Polo,Bronze
11961,1968,Mexico,Athletics,Athletics,"FOSBURY, Richard Douglas",USA,Men,High Jump,Gold
11742,1968,Mexico,Aquatics,Swimming,"WENDEN, Michael Vincent",AUS,Men,200M Freestyle,Gold
13996,1976,Montreal,Aquatics,Swimming,"MAC DONALD, Gary",CAN,Men,4X100M Medley Relay,Silver
16229,1980,Moscow,Rowing,Rowing,"DMITRIENKO, Grigori",URS,Men,Eight With Coxswain (8+),Bronze
19728,1992,Barcelona,Aquatics,Swimming,"KULIKOV, Vladislav",EUN,Men,4X100M Medley Relay,Silver
25901,2004,Athens,Boxing,Boxing,"YELEUOV, Serik",KAZ,Men,57 - 60KG (Lightweight),Bronze

In [ ]:
city_country = {"Paris":"France", "Mexico":"Mexico", "Montreal":"Canada", "Moscow":"Russia", "Barcelona":"Spain", "Athens": "Greece"}

In [ ]:
city_country

In [ ]:
sample.City.map(city_country)

In [ ]:
sample["Host_Country"] = sample.City.map(city_country)

In [ ]:
sample

In [17]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [19]:
mapper = {1:"First", 2:"Second", 3:"Third"}

In [20]:
titanic.pclass.map(mapper)

0       Third
1       First
2       Third
3       First
4       Third
        ...
886    Second
887     First
888     Third
889     First
890     Third
Name: pclass, Length: 891, dtype: object

In [21]:
titanic.pclass = titanic.pclass.map(mapper)

In [22]:
titanic.head()

   survived pclass     sex   age  sibsp  parch     fare embarked deck
0         0  Third    male  22.0      1      0   7.2500        S  NaN
1         1  First  female  38.0      1      0  71.2833        C    C
2         1  Third  female  26.0      0      0   7.9250        S  NaN
3         1  First  female  35.0      1      0  53.1000        S    C
4         0  Third    male  35.0      0      0   8.0500        S  NaN

### Conditional Transformation

In [ ]:
titanic.head(10)

In [ ]:
titanic.no_relat == 0

In [ ]:
pd.Series(np.where(titanic.no_relat == 0, "Yes", "No"))

In [ ]:
titanic["alone"] = pd.Series(np.where(titanic.no_relat == 0, "Yes", "No"))

In [ ]:
titanic.head(10)

In [ ]:
titanic["child"] = pd.Series(np.where(titanic.age < 18, "Yes", "No"))

In [ ]:
titanic.head(10)

### Discretization and Binning with pd.cut() (Part 1)

In [23]:
titanic.head(10)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0   Third    male  22.0      1      0   7.2500        S  NaN
1         1   First  female  38.0      1      0  71.2833        C    C
2         1   Third  female  26.0      0      0   7.9250        S  NaN
3         1   First  female  35.0      1      0  53.1000        S    C
4         0   Third    male  35.0      0      0   8.0500        S  NaN
5         0   Third    male   NaN      0      0   8.4583        Q  NaN
6         0   First    male  54.0      0      0  51.8625        S    E
7         0   Third    male   2.0      3      1  21.0750        S  NaN
8         1   Third  female  27.0      0      2  11.1333        S  NaN
9         1  Second  female  14.0      1      0  30.0708        C  NaN

In [24]:
age_bins = [0, 10, 18, 30, 55, 100]

In [25]:
cats = pd.cut(titanic.age, age_bins, right = False)

In [26]:
cats

0      [18.0, 30.0)
1      [30.0, 55.0)
2      [18.0, 30.0)
3      [30.0, 55.0)
4      [30.0, 55.0)
           ...
886    [18.0, 30.0)
887    [18.0, 30.0)
888             NaN
889    [18.0, 30.0)
890    [30.0, 55.0)
Name: age, Length: 891, dtype: category
Categories (5, interval[int64]): [[0, 10) < [10, 18) < [18, 30) < [30, 55) < [55, 100)]

In [27]:
cats.value_counts()

[30, 55)     288
[18, 30)     271
[0, 10)       62
[10, 18)      51
[55, 100)     42
Name: age, dtype: int64

In [28]:
titanic["age_cat"] = cats

In [29]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,age_cat
0,0,Third,male,22.0,1,0,7.2500,S,NaN,"[18, 30)"
1,1,First,female,38.0,1,0,71.2833,C,C,"[30, 55)"
2,1,Third,female,26.0,0,0,7.9250,S,NaN,"[18, 30)"
3,1,First,female,35.0,1,0,53.1000,S,C,"[30, 55)"
4,0,Third,male,35.0,0,0,8.0500,S,NaN,"[30, 55)"

In [40]:
titanic.groupby("age_cat").survived.mean()

age_cat
[0, 10)      0.612903
[10, 18)     0.450980
[18, 30)     0.350554
[30, 55)     0.420139
[55, 100)    0.309524
Name: survived, dtype: float64

In [42]:
titanic.pivot_table (index = "age_cat", aggfunc = "mean", values = "survived")

           survived
age_cat
[0, 10)    0.612903
[10, 18)   0.450980
[18, 30)   0.350554
[30, 55)   0.420139
[55, 100)  0.309524

In [ ]:
group_names = ["child", "teenager", "young_adult", "adult", "elderly"]

In [ ]:
pd.cut(titanic.age, age_bins, right = False, labels = group_names)

In [ ]:
titanic["age_cat"] = pd.cut(titanic.age, age_bins, right = False, labels = group_names)

In [ ]:
titanic.head(10)

In [ ]:
titanic.age_cat

### Discretization and Binning with pd.cut() (Part 2)

In [ ]:
titanic.fare

In [ ]:
pd.cut(titanic.fare, 5, precision= 3)

In [ ]:
titanic["fare_cat"] = pd.cut(titanic.fare, 5, precision= 0)

In [ ]:
titanic.head(10)

In [ ]:
titanic.fare_cat.value_counts()

### Discretization and Binning with pd.qcut()

In [ ]:
titanic.head()

In [ ]:
pd.qcut(titanic.fare, 5)

In [ ]:
titanic["fare_cat"] = pd.qcut(titanic.fare, 5)

In [ ]:
titanic.head()

In [ ]:
titanic.fare_cat.value_counts()

In [ ]:
pd.qcut(titanic.fare, [0, 0.1, 0.25, 0.5, 0.9, 1], precision = 0)

In [ ]:
fare_labels =["very_cheap", "cheap", "moderate", "exp", "very_exp"]

In [ ]:
titanic["fare_cat"] =  pd.qcut(titanic.fare, [0, 0.1, 0.25, 0.5, 0.9, 1], precision = 0, labels = fare_labels)

In [ ]:
titanic.head()

In [ ]:
titanic.fare_cat.value_counts()

In [ ]:
titanic.groupby(["age_cat", "fare_cat"]).survived.mean().unstack()

### Caps and Floors

In [ ]:
titanic.head()

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
titanic.fare.plot(figsize = (12,8))
plt.show()

In [ ]:
titanic.fare.describe()

In [ ]:
titanic.fare.sort_values(ascending = False)

In [ ]:
fare_cap = 250

In [ ]:
titanic.loc[titanic.fare > fare_cap, "fare"] = fare_cap

In [ ]:
fare_floor = 5

In [ ]:
titanic.loc[titanic.fare < fare_floor, "fare"] = fare_floor

In [ ]:
titanic.head()

### Scaling / Standardization

In [ ]:
titanic.head()

In [ ]:
titanic.describe()

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
titanic.fare.plot(figsize = (12,8))
titanic.age.plot(figsize = (12,8))
plt.show()

In [ ]:
mean_age = titanic.age.mean()
mean_fare = titanic.fare.mean()

In [ ]:
std_age = titanic.age.std()
std_fare = titanic.fare.std()

In [ ]:
titanic["age_z"] = round((titanic.age-mean_age) / std_age,2)
titanic["fare_z"] = round((titanic.fare-mean_fare) / std_fare,2)

In [ ]:
titanic.head(10)

In [ ]:
round(titanic.describe(),2)

In [ ]:
titanic.fare_z.plot(figsize = (12,8))
titanic.age_z.plot(figsize = (12,8))
plt.show()

In [ ]:
#titanic.to_csv("titanic_prep.csv", index = False)

In [ ]:
titanic.head()

In [ ]:
titanic.drop(labels = ["age", "alone", "child", "age_z", "fare_z", "fare_cat"], axis = 1, inplace = False)

### Creating Dummy Variables

In [ ]:
titanic.head()

In [ ]:
titanic.drop(labels = ["age", "alone", "child", "age_z", "fare_z", "fare_cat"], axis = 1, inplace = True)

In [ ]:
titanic.head()

In [ ]:
titanic_d = pd.get_dummies(titanic, columns = ["sex", "pclass", "embarked", "age_cat"], drop_first=True)

In [ ]:
titanic_d.head()

In [ ]:
titanic_d.info()

### String Operations

In [ ]:
import pandas as pd

In [ ]:
summer = pd.read_csv("summer.csv")

In [ ]:
summer.head()

In [ ]:
summer.Athlete = summer.Athlete.str.title()

In [ ]:
summer.Athlete.str.split(", ", n = 1, expand = True)

In [ ]:
summer[["Surname", "First_Name"]] = summer.Athlete.str.split(", ", n = 1, expand = True)

In [ ]:
summer.head()

In [ ]:
summer["Surname"] = summer.Surname.str.strip()

In [ ]:
summer["First_Name"] = summer.First_Name.str.strip()

In [ ]:
summer.drop(columns = "Athlete")